extends Node

enum characters {Нет, ГлавныйГерой, Вы, Ты, Алиса, Катя, Валя, Гальхя, Фейхья,
Калия, Лира, Дорман, Фея, Сигурд, ЗверьГнева, ЗверьСмерти, Незнакомец, Незнакомка, Прохожий,
Мужчина, Женщина, Девушка, Подросток, Мальчик, Девочка, Ребёнок, КастомныйПерсонаж}

enum emotions {Без_эмоции, В_мыслях, Радостно, Счастливо, Смеясь, Веселясь, Хихикая, Грустно,
Печально, Огорчённо, Недовольно, Шокированно, Удивлённо, Пугливо, Испуганно, Боясь, Истеря, Плача, Злясь, Злостно,
Яростно, Безумно, Неистово, Подозрительно, Раздосадованно, Задумчиво, Насмешливо, Издеваясь, Не_доверчиво, Прищурившись,
Присмотревшись, Страсно, Возбуждённо, Влюблённо, Стыдливо, Смущённо}

enum types_of_interpolation {parent, instantaneous, linear}
enum types_of_linear_dialog_interpolation {instantaneous, linear}
enum action_types {visible, sound, music}
enum languages {Ru, En}
